Repository: Korgys/oneheim
Catalog: Roguelike.Console/Properties/i18n/Messages.*.resx
Languages: fr

source: A boss arrives
fr: Un boss arrive

# ArminFirstMeeting
source: Greetings, traveler. Welcome to Oneheim… or what remains of it. This village is but a heap of ruins. I have raised a camp here and set palisades against the night. Beware, for beyond these walls danger waits at every step.
fr: Salutations, voyageur. Sois le bienvenu à Oneheim, ou plutôt, à ce qu’il en reste. Ce village n’est plus qu’un champ de ruines. J’y ai établi un camp et élevé des palissades. Prends garde, car au-dehors, le danger guette à chaque pas.

# ArminMeeting
source: Back again? The wilds look harsh today. Tell me, friend, what may I do for you?
fr: Déjà de retour ? L’extérieur du camp paraît bien rude en ce jour. Que puis-je faire pour toi, ami ?

# ArminMeetingBaseCampUnderAttack
source: To arms! The shadows breach our palisades! Hold fast! We shall not yield!
fr: Aux armes ! Les ombres ont franchi nos palissades ! Tenez bon, nous ne céderons point !

# ArminMeetingFirstBossComing
source: I heard ghastly cries beyond the walls, freezing the blood in my veins. Some foul creature prowls in the shadows. Beware, traveler.
fr: J’ai ouï de sinistres cris au-dehors, glaçant mon sang dans mes veines. Une créature rôde dans les ombres. Prends garde à toi, voyageur.

# ArminMeetingFirstBossDefeated
source: Word has spread, you have vanquished that dreadful beast. Never had I imagined such strength in you. It is a true blessing to have you among us! Accept my eternal gratitude. Tell me, how might I repay such a debt?
fr: La rumeur s’est répandue : vous avez terrassé ce monstre abominable. Jamais je n’aurais cru votre force si grande. C’est une bénédiction que de vous compter parmi nous ! Recevez ma gratitude éternelle. Que puis-je faire pour vous témoigner ma reconnaissance ?

# ArminMeetingFirstBossHere
source: Travelers speak of a mighty foe haunting these lands. If only a valiant soul were strong enough to deliver us from this bane… May the camp’s palisades hold until then.
fr: Des voyageurs ont confirmé la présence d’un ennemi redoutable rôdant dans ces terres. Si seulement une âme assez vaillante pouvait nous délivrer de ce fléau… Puissent les palissades du camp tenir bon jusque-là.

# ArminMeetingPlayerLowLife
source: By the gods, you look on the brink of collapse! Rest a while. This camp was meant as a haven for the weary.
fr: Par les dieux, tu sembles à bout de forces ! Repose-toi un instant, ce camp est fait pour offrir un havre aux âmes éreintées.

# ArminMeetingPlayerRich
source: That is a heavy purse you carry. May it serve to raise Oneheim anew and kindle fresh hopes.
fr: Voilà une bourse bien lourde que tu portes là. Puisse-t-elle servir à relever Oneheim et à bâtir de nouvelles espérances.

source: Base Camp HP:
fr: Etat du camp de base :

source: Be carefull, you are not safe here ...
fr: Soyez prudent, des ennemis rôdent ...

# CampAlreadyRepair
source: The camp is already in perfect shape.
fr: Le camp est déjà réparé.

source: Can you heal me?
fr: Pouvez-vous me soigner ?

source: Can you repair the camp?
fr: Pouvez-vous réparer le camp ?

source: Game Over! Press Enter to exit.
fr: Game Over ! Appuyez sur Entrée pour quitter.

source: Goodbye.
fr: Au revoir.

source: Maybe later.
fr: Peut-être plus tard.

# NeedHealing
source: I need healing.
fr: J'ai besoin de me soigner.

source: No camp to repair
fr: Il n'y a plus de camp à réparer. Tout est détruit.

# NotEnoughGold
source: You do not have enough gold.
fr: Vous n'avez pas assez d'or pour ça.

# NothingToRepair
source: There is nothing to repair here.
fr: Il n'y a rien à réparer.

source: Pay and repair
fr: Payer et réparer

source: Repair the camp.
fr: Il faudrait réparer le camp.

# StepAndLevel
source: Steps: {0} | Lvl: {1}
fr: Pas: {0} | Niveau: {1}

# TheCampIsAlreadyFullyRepair
source: The camp is already fully repaired.
fr: Le camp est déjà complètement réparé.

source: The End! Press Enter to exit.
fr: The End! Appuyez sur Entrée pour quitter.

source: The enemy dodged your attack!
fr: L'ennemi a esquivé votre attaque !

# TheFogIntensifies
source: The fog intensifies. New enemies and treasures have appeared!
fr: Le brouillard s'épaissit ! De nouveaux ennemis et trésors sont apparus !

source: You defeated all bosses
fr: Vous avez vaincu tous les boss.

# YouDodgedTheEnemyAttack
source: You dodged the enemy's attack!
fr: Vous avez esquivé l'attaque de votre ennemi !

# YouWereAttackedAndDefeatedYourEnemy
source: You were attacked and you defeated your enemy !
fr: Vous avez été attaqué et vous avez vaincu votre ennemi.

# YouWereKilledBy
source: You were killed by {0}.
fr: Vous avez été tué par {0}.
